<a href='https://www.darshan.ac.in/'> <img src='https://www.darshan.ac.in/Content/media/DU_Logo.svg' width="250" height="300"/></a>
<pre>
<center><b><h1>Machine Learning - 2301CS621</b></center>

<center><b><h1>Lab - 1</b></center>
    <center><b><h1>Yash Dhameliya</b></center>
        <center><b><h1>23010101061</b></center>
            <center><b><h1>Date : 24-11-25</b></center>
<pre>

# NumPy Exercises
## We'll start off with a few simple tasks

## import numpy as np

In [2]:
import numpy as np

In [14]:
import pandas as pd

numpy.ndarray

In [4]:
arr = np.array([1,2,3,4])
arr

array([1, 2, 3, 4])

In [5]:
arr.dtype

dtype('int64')

## Create an array of 10 zeros

In [8]:
arr = np.zeros(10)
arr

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

## Create an array of 10 ones

In [9]:
arr1 = np.ones(10)
arr1

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

## Create an array of 10 fives

In [10]:
arr5 = np.ones(10) * 5
arr5

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

## Create an array of the integers from 10 to 50

In [11]:
arr = np.arange(10, 50, 2)
arr

array([10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42,
       44, 46, 48])

## Create a 3x3 matrix with values ranging from 0 to 8

In [12]:
arr = np.arange(0, 9, 1).reshape(3,3)
arr

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [13]:
arr = np.arange(0, 9, 1).reshape(9,-1)
arr

array([[0],
       [1],
       [2],
       [3],
       [4],
       [5],
       [6],
       [7],
       [8]])

In [14]:
arr = np.arange(0, 9, 1).reshape(-1,9)
arr

array([[0, 1, 2, 3, 4, 5, 6, 7, 8]])

## Create a 3x3 identity matrix

In [17]:
identity = np.identity(3)
identity

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

## Create following matrix  = <br/>
<pre>array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])</pre>

In [18]:
arr = np.arange(1, 26, 1).reshape(5,5)
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [19]:
//slicing
arr = np.arange(1, 26, 1).reshape(5,5)[2:, 1:]
arr

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

## Output should be =
<pre>array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])</pre>

## Output should be = <br/>
<pre>array([[ 2],
       [ 7],
       [12]])</pre>

In [20]:
arr = np.arange(1, 26, 1).reshape(5,5)[0:3:, 1:2]
arr

array([[ 2],
       [ 7],
       [12]])

## Find Odd Numbers
Extract all odd numbers from `arr`.

`arr = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])` <BR>
Use Condtional Selection

In [3]:
arr = np.array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [4]:
arr[arr%2!=0]

array([1, 3, 5, 7, 9])

## Stacking
Stack array `a` and `b` vertically.

`a = np.arange(10).reshape(2,-1)`
`b = np.repeat(1, 10).reshape(2,-1)`

In [5]:
a = np.arange(10).reshape(2,-1)
b = np.repeat(1, 10).reshape(2,-1)

In [10]:
arr = np.vstack((a, b))
arr

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9],
       [1, 1, 1, 1, 1],
       [1, 1, 1, 1, 1]])

##  Range Filtering
Get all items between 5 and 10 from `a`.

`a = np.array([2, 6, 1, 9, 10, 3, 27])`

In [11]:
a = np.array([2, 6, 1, 9, 10, 3, 27])
a[(a >= 5) & (a <= 10)]

array([ 6,  9, 10])

## Matrix Multiplication
Multiply a 5x3 matrix by a 3x2 matrix (dot product).

In [12]:
A = np.random.random((5,3))
B = np.random.random((3,2))

In [13]:
A @ B

array([[1.0916941 , 1.08773075],
       [1.01835829, 1.02319109],
       [0.81356211, 0.75894689],
       [0.47191924, 0.52716796],
       [0.88990695, 0.92681547]])

# Great Job! Youâ€™re Halfway Through ðŸš€  | PANDAS  Exercises

 **Context:** You are a Data Analyst at "TechCorp". 
HR has asked you to analyze employee data to understand attrition, salary trends, and job satisfaction.

**Instructions:**
1. Write your code in the empty cells.

### 1. Load & Inspect
Load `employee_data.csv` into a DataFrame named `df`. Display the first 5 rows and check column data types.

In [15]:
df = pd.read_csv("employee_data.csv")

In [16]:
df

,EmployeeID,Age,Department,JobRole,Attrition,MonthlyIncome,YearsAtCompany,JobSatisfaction,PerformanceRating,PercentSalaryHike,DistanceFromHome,MaritalStatus
0,1001,50,Research & Development,Data Scientist,No,8415,19,1,4,16,20,Married
1,1002,36,Research & Development,Data Scientist,No,6391,19,3,4,21,21,Married
2,1003,29,Sales,Data Scientist,No,14157,17,1,4,22,18,Married
3,1004,42,Sales,Sales Exec,No,14835,13,3,4,18,24,Married
4,1005,40,Sales,Software Engineer,No,8951,16,4,3,22,27,Single
...,...,...,...,...,...,...,...,...,...,...,...,...
195,1196,40,Research & Development,Sales Exec,Yes,9704,7,4,3,10,29,Married
196,1197,41,Sales,Lab Technician,No,7422,17,3,3,12,15,Divorced
197,1198,53,Research & Development,Data Scientist,No,12984,7,3,3,23,28,Divorced
198,1199,28,Sales,Software Engineer,No,4759,14,4,3,21,3,Married
199,1200,54,Research & Development,Sales Exec,Yes,14404,15,1,3,19,8,Single

### 2. Filter IT Department
Create a DataFrame `df_rd` containing only employees from the `'Research & Development'` department.

In [17]:
df[df.Department == "Research & Development"]

,EmployeeID,Age,Department,JobRole,Attrition,MonthlyIncome,YearsAtCompany,JobSatisfaction,PerformanceRating,PercentSalaryHike,DistanceFromHome,MaritalStatus
0,1001,50,Research & Development,Data Scientist,No,8415,19,1,4,16,20,Married
1,1002,36,Research & Development,Data Scientist,No,6391,19,3,4,21,21,Married
5,1006,44,Research & Development,HR Manager,Yes,8468,8,4,3,12,11,Single
6,1007,32,Research & Development,Data Scientist,No,11007,19,2,3,19,2,Married
8,1009,45,Research & Development,Data Scientist,No,12444,1,3,3,16,18,Married
...,...,...,...,...,...,...,...,...,...,...,...,...
193,1194,47,Research & Development,Data Scientist,No,8182,10,3,4,14,14,Married
194,1195,24,Research & Development,Software Engineer,No,12916,16,1,3,10,27,Divorced
195,1196,40,Research & Development,Sales Exec,Yes,9704,7,4,3,10,29,Married
197,1198,53,Research & Development,Data Scientist,No,12984,7,3,3,23,28,Divorced
199,1200,54,Research & Development,Sales Exec,Yes,14404,15,1,3,19,8,Single

### 3. Salary Check
Find the employee with the highest `MonthlyIncome`. Display their `JobRole` and `MonthlyIncome`.

In [20]:
data = df[df.MonthlyIncome == df.MonthlyIncome.max()]
data[['Department', 'MonthlyIncome']]

                Department  MonthlyIncome
28  Research & Development          14954

### 4. Missing Values
Check if there are any missing values (`NaN`) in the dataset.

In [21]:
df.isnull().sum()

EmployeeID           0
Age                  0
Department           0
JobRole              0
Attrition            0
MonthlyIncome        0
YearsAtCompany       0
JobSatisfaction      0
PerformanceRating    0
PercentSalaryHike    0
DistanceFromHome     0
MaritalStatus        0
dtype: int64

### 5. Average Age by Role
Calculate the average `Age` for each `JobRole`.

In [23]:
df.groupby("JobRole").Age.mean()

JobRole
Data Scientist       38.771429
HR Manager           39.926829
Lab Technician       38.673469
Sales Exec           44.000000
Software Engineer    40.395349
Name: Age, dtype: float64

### 6. Attrition Count
How many employees have left the company? (Count values in the `Attrition` column).

In [32]:
data = df.groupby("Attrition").count()
data['EmployeeID']

Attrition
No     167
Yes     33
Name: EmployeeID, dtype: int64

### 7. High Performers
Filter for employees with `PercentSalaryHike` > 15 **AND** `PerformanceRating` == 4.

In [37]:
df[(df.PercentSalaryHike < 15) & (df.PerformanceRating == 4)]

,EmployeeID,Age,Department,JobRole,Attrition,MonthlyIncome,YearsAtCompany,JobSatisfaction,PerformanceRating,PercentSalaryHike,DistanceFromHome,MaritalStatus
28,1029,58,Research & Development,HR Manager,No,14954,1,2,4,12,8,Divorced
31,1032,30,Human Resources,Software Engineer,No,8984,8,3,4,12,1,Divorced
38,1039,23,Research & Development,Lab Technician,No,4248,19,3,4,10,22,Single
63,1064,42,Human Resources,Software Engineer,Yes,13789,1,2,4,14,19,Divorced
65,1066,39,Research & Development,Lab Technician,Yes,14260,5,4,4,13,14,Single
89,1090,29,Sales,Lab Technician,No,5674,2,4,4,13,6,Married
116,1117,53,Research & Development,HR Manager,No,6531,13,4,4,10,19,Married
123,1124,57,Sales,Software Engineer,No,6177,11,4,4,14,3,Married
191,1192,57,Research & Development,Software Engineer,No,6701,13,1,4,14,21,Married
193,1194,47,Research & Development,Data Scientist,No,8182,10,3,4,14,14,Married

### 8. Satisfaction Analysis (Pivot Table)
Create a pivot table showing the **average** `MonthlyIncome` for each `Department` (rows) broken down by `JobSatisfaction` (columns).

In [39]:
table = df.pivot_table(values='MonthlyIncome', index='Department', columns='JobSatisfaction', aggfunc='mean')
print(table)

JobSatisfaction                    1            2            3            4
Department
Human Resources          8494.666667  8822.200000  8196.333333  7744.833333
Research & Development  10810.718750  8581.125000  8648.090909  8930.304348
Sales                    9795.789474  9590.461538  8459.461538  9045.000000

### 9. Feature Engineering (Seniority)
Create a new column `Seniority`.
* If `YearsAtCompany` > 10, value is `'Senior'`
* Otherwise, value is `'Junior'`

Count how many Seniors vs Juniors there are.

### 10. Retention Risk (Complex Filter)
Identify 'High Risk' employees who meet **ALL** these criteria:
1. `MaritalStatus` is 'Single'
2. `JobSatisfaction` is less than 3
3. `DistanceFromHome` > 10

Display their `EmployeeID` and `JobRole`.

In [40]:
data = df[(df.MaritalStatus == 'Single') & (df.JobSatisfaction < 3) & (df.DistanceFromHome > 10)]
data[['EmployeeID', 'JobRole']]

     EmployeeID            JobRole
20         1021  Software Engineer
30         1031     Lab Technician
42         1043         HR Manager
43         1044         HR Manager
45         1046  Software Engineer
78         1079     Data Scientist
93         1094     Lab Technician
108        1109         Sales Exec
112        1113     Data Scientist
119        1120  Software Engineer
124        1125         HR Manager
159        1160         HR Manager
161        1162     Data Scientist
168        1169         HR Manager
169        1170         Sales Exec
172        1173  Software Engineer
174        1175         HR Manager
183        1184     Lab Technician
185        1186     Data Scientist